app/controllers/codes_controller.rb

SELECT * FROM "vote_options"
---
  def show
    @vote_options = VoteOption.all