app/controllers/codes_controller.rb

  def show
    if params[:language_slug].nil? || (params[:language_slug] == 'all' && params[:code_id].nil?)
      path_to_redir = "/all/#{random_code(Code.all)}"
---
SELECT * FROM "codes"